[
  {
    "id": 1,
    "link": "https://belle-gold.vercel.app/",
    "title": "Belle",
    "image": "http://res.cloudinary.com/dxoemtk19/image/upload/v1738160692/portfolio-assets/kh09qjfyjs0rcz8xekrc.png",
    "video": "http://res.cloudinary.com/dxoemtk19/video/upload/v1738160667/portfolio-assets/hxhsfw9yiqq0c4zyet6p.mp4",
    "ldescription": "Built a responsive fashion eCommerce site with React, Redux Toolkit, and pagination, featuring persistent cart for a seamless shopping experience.\n",
    "bdescription": "Developed a fully responsive and user-friendly fashion eCommerce website using React and Redux Toolkit. The application features an intuitive design that ensures a seamless shopping experience across devices. Implemented pagination for efficient browsing through a large catalog of fashion items and a persistent cart system to save users' selections even after they leave the site. Designed the frontend to prioritize performance and usability, with efficient state management for smooth navigation and updates. The project demonstrates strong proficiency in building scalable eCommerce solutions with modern web technologies.\n",
    "category": "web"
  },
  {
    "id": 2,
    "link": "https://a-cars.vercel.app/",
    "title": "A-cars",
    "image": "http://res.cloudinary.com/dxoemtk19/image/upload/v1738163683/portfolio-assets/wpi9mariociowzlib3uh.png",
    "video": "http://res.cloudinary.com/dxoemtk19/video/upload/v1738163632/portfolio-assets/qghpqistyvsf9v6rmwvs.mp4",
    "ldescription": "Built a responsive fashion eCommerce site with React, Redux Toolkit, and pagination, featuring persistent cart for a seamless shopping experience.\n",
    "bdescription": "Developed a full-stack car browsing application that allows users to explore a wide selection of vehicles, manage their cart and wishlist, and securely handle authentication with JWT. The frontend is built with React, leveraging TanStack Query for efficient data fetching, caching, and state management, optimizing performance and user experience. React Hook Form is used for seamless form validation, simplifying user input handling. The backend is built with Express.js and MongoDB, ensuring a scalable and secure environment. User passwords are hashed with bcryptjs for added security. The application is optimized for smooth and intuitive browsing, enabling users to explore car options, track preferences, and complete purchases easily.\n",
    "category": "web"
  },
  {
    "id": 3,
    "link": "https://anteqs-carvan.netlify.app/",
    "title": "Carvan",
    "image": "http://res.cloudinary.com/dxoemtk19/image/upload/v1738165368/portfolio-assets/kmoydejce6qn0eshndvw.png",
    "video": "http://res.cloudinary.com/dxoemtk19/video/upload/v1738165352/portfolio-assets/sghicaxgrlqgrlfpfind.mp4",
    "ldescription": "Developed a car website using HTML, CSS, and jQuery, featuring Google Maps integration, filtering options, and smooth animations.",
    "bdescription": "Developed a dynamic car website using HTML, CSS, and jQuery, featuring Google Maps integration, advanced filtering options, and smooth animations to enhance the user experience. The website allows users to effortlessly explore car listings with an interactive map, providing real-time location details for each vehicle. Multiple filtering options enable users to narrow down their search based on specific criteria such as make, model, price, and more. Smooth animations create seamless transitions between sections, offering a fluid and engaging browsing experience. The responsive design, built with HTML and CSS, ensures compatibility across devices, while jQuery optimizes functionality, making the website both visually appealing and easy to navigate.",
    "category": "web"
  },
  {
    "id": 4,
    "link": "https://anteqs-ecommerce.netlify.app/",
    "title": "E-store",
    "image": "http://res.cloudinary.com/dxoemtk19/image/upload/v1738165640/portfolio-assets/omwmazbw84fpxpcycmpt.png",
    "video": "http://res.cloudinary.com/dxoemtk19/video/upload/v1738165631/portfolio-assets/cykwdspiy9vip9yxj8ze.mp4",
    "ldescription": "Designed a visually appealing website using HTML, CSS, and JavaScript, featuring scroll animations and Google Maps integration.",
    "bdescription": "Designed a visually appealing website using HTML, CSS, and JavaScript, featuring smooth scroll animations and Google Maps integration to create an interactive and engaging user experience. The website incorporates visually striking animations triggered by scroll events, enhancing the flow of content and making navigation feel dynamic. Google Maps is seamlessly integrated to provide users with interactive location-based features, improving usability. The combination of HTML, CSS, and JavaScript ensures a responsive, modern design that adapts across different devices while offering an intuitive and visually rich browsing experience.",
    "category": "web"
  },
  {
    "id": 5,
    "link": "https://anteqs-ng-restaurant.netlify.app",
    "title": "Ng-Restaurant",
    "image": "http://res.cloudinary.com/dxoemtk19/image/upload/v1738784091/portfolio-assets/dtqcarv2cb1wmu1b30fc.png",
    "video": "http://res.cloudinary.com/dxoemtk19/video/upload/v1738784030/portfolio-assets/ebldfjvfv4xiwqozslgo.mp4",
    "ldescription": "Built a visually appealing restaurant app with Angular, TypeScript, and CSS, featuring smooth animations and optimized images for improved performance.",
    "bdescription": "Built a visually appealing restaurant app using Angular, TypeScript, and CSS, featuring smooth animations and optimized images to enhance the overall user experience and performance. The app is designed with a modern, user-friendly interface, ensuring easy navigation and interaction. Animations are integrated for a dynamic and engaging experience, while image optimization helps to reduce loading times and improve performance across devices. The use of Angular and TypeScript ensures scalability, maintainability, and a structured development process, making the app both efficient and responsive.",
    "category": "web"
  },
  {
    "id": 6,
    "link": "https://nike-store-seven-self.vercel.app",
    "title": "Nike Store",
    "image": "http://res.cloudinary.com/dxoemtk19/image/upload/v1738864013/portfolio-assets/q4xtzoodtttvkhzhdh5b.png",
    "video": "http://res.cloudinary.com/dxoemtk19/video/upload/v1738863949/portfolio-assets/wfmeplteu6s0xdqpqxvx.mp4",
    "ldescription": "Built a dynamic Nike shoe website with React, featuring glass morphism, fade effects, and interactive animations, ensuring a responsive and engaging user experience.",
    "bdescription": "Developed a visually striking and interactive Nike shoe website using React, incorporating modern UI/UX techniques to enhance user engagement. The design features glass morphism, creating a sleek, futuristic look with transparent and blurred elements. Smooth fade effects and interactive animations bring the interface to life, providing a seamless browsing experience. The website is fully responsive, ensuring optimal performance across various screen sizes and devices. Through intuitive navigation and dynamic visuals, users can explore Nike’s latest shoe collections in an immersive and engaging way.",
    "category": "web"
  },
  {
    "id": 7,
    "link": "https://elite-oceanic.vercel.app/",
    "title": "EliteOceanic",
    "image": "http://res.cloudinary.com/dxoemtk19/image/upload/v1739220979/portfolio-assets/rbj7ljkpcn5zhjz1aa5l.png",
    "video": "http://res.cloudinary.com/dxoemtk19/video/upload/v1739220597/portfolio-assets/mtqsbaucwknvtkxoaw6y.mp4",
    "ldescription": "Built a responsive banking app UI with React, TypeScript, and Tailwind CSS, featuring GSAP animations, real-time messaging, and interactive particle effects for an engaging user experience.",
    "bdescription": "Designed and developed a modern, responsive banking app UI using React, TypeScript, and React Router DOM, ensuring smooth and intuitive navigation. The interface is styled with Tailwind CSS, providing a clean and scalable design, while GSAP animations enhance the user experience with fluid transitions and dynamic effects. To foster seamless communication, a real-time messaging feature was integrated, allowing users to interact directly with the owner. The hero page is brought to life with interactive particle animations powered by tsparticles, adding a visually engaging touch. Through a combination of real-time interactivity and sleek UI elements, the application delivers an immersive and user-friendly experience.",
    "category": "web"
  },
  {
    "id": 8,
    "link": "https://github.com/ayindequdus22/shoppe.git",
    "title": "Shoppe",
    "image": "http://res.cloudinary.com/dxoemtk19/image/upload/v1740823331/portfolio-assets/z3vycw5bbryet8vt0ydn.png",
    "video": "http://res.cloudinary.com/dxoemtk19/video/upload/v1740823321/portfolio-assets/pis9rr29vrq8r0olac3a.mp4",
    "ldescription": "A modern e-commerce app with secure authentication, a category carousel, and a dynamic home featuring flash deals with a countdown timer.",
    "bdescription": "Experience seamless shopping with our modern e-commerce mobile app. Get started with a secure registration and login process with robust input validation to ensure smooth access. The app welcomes users with an interactive carousel showcasing different product categories, making browsing easy and intuitive. On the home page, discover exciting flash deals with a live countdown timer, ensuring you never miss out on great discounts. Browse through a wide range of products, all displayed in a user-friendly layout designed for an engaging shopping experience. Enjoy a sleek, responsive, and feature-rich app that makes online shopping effortless!",
    "category": "mobile"
  },
  {
    "id": 9,
    "link": "https://github.com/ayindequdus22/Avenopay",
    "title": "Avenopay",
    "image": "https://res.cloudinary.com/dxoemtk19/image/upload/v1757934010/avenopay_image.png",
    "video": "https://res.cloudinary.com/dxoemtk19/video/upload/v1757933969/avenopay-video.mp4",
    "ldescription": "AvenoPay is a secure, high-performance financial app built with Flutter. It offers seamless cross-platform use, efficient network calls via Dio, and secure storage for sensitive data. Features include instant transfers, airtime purchases, and easy loan access—all in a safe, user-friendly interface.",
    "bdescription": "AvenoPay is designed for speed, security, and everyday convenience. Built with Flutter, it offers smooth, consistent experiences across iOS and Android. Behind the scenes, Dio powers fast, reliable API calls, while flutter_secure_storage keeps sensitive data encrypted and safe. With AvenoPay, you can instantly send and receive money, recharge airtime and data across all major networks, and access short-term loans with a simple process. By combining cutting-edge technology with essential features, AvenoPay delivers a trustworthy, all-in-one financial solution.",
    "category": null
  }
]